In [8]:
import pandas as pd

### séries (misto de vetor ou lista com dicionário)

dic_alunos = {'M02': 'JOÃO',
             'M05': 'MARIA',
              'M13': 'BILL',
              'M14': 'CRIS',
              'M19': 'JIMI'}

alunos = pd.Series(dic_alunos)
alunos[1:4]

M05    MARIA
M13     BILL
M14     CRIS
dtype: object

In [9]:
alunos[['M05', 'M14']]

M05    MARIA
M14     CRIS
dtype: object

In [11]:
s1 = pd.Series([2,4,6])
s2 = pd.Series([1,3,5])

s1 * 2

0     4
1     8
2    12
dtype: int64

In [12]:
s1 * s2

0     2
1    12
2    30
dtype: int64

In [13]:
import numpy as np

np.sqrt(s2)

0    1.000000
1    1.732051
2    2.236068
dtype: float64

In [16]:
# Dataframes

paises = pd.read_csv('https://raw.githubusercontent.com/celsocrivelaro/simple-datasets/main/paises.csv', index_col='sigla')

paises

              nome continente  extensao  corVerde
sigla
AR       Argentina    América      2780         0
BR          Brasil    América      8511         1
FR          França     Europa       644         0
IT          Itália     Europa       301         1
UK     Reino Unido     Europa       244         0

In [19]:
paises.iloc[0] # iloc: indice de localização

nome          Argentina
continente      América
extensao           2780
corVerde              0
Name: AR, dtype: object

In [20]:
paises.loc['AR'] # Para esse comando funcionar é necessário adicionar o comando index_col

nome          Argentina
continente      América
extensao           2780
corVerde              0
Name: AR, dtype: object

In [25]:
# filtro de colunas

paises[['nome', 'extensao']] # mostrar somente as colunas selecionadas

              nome  extensao
sigla
AR       Argentina      2780
BR          Brasil      8511
FR          França       644
IT          Itália       301
UK     Reino Unido       244

In [33]:
# filtro de linhas

paises[(paises['extensao'] > 2000) & (paises['corVerde'] ==1)]

         nome continente  extensao  corVerde
sigla
BR     Brasil    América      8511         1

In [34]:
# adicionar nova coluna

paises['area_em_km2'] = paises['extensao'] * 1_000_000
paises

              nome continente  extensao  corVerde  area_em_km2
sigla
AR       Argentina    América      2780         0   2780000000
BR          Brasil    América      8511         1   8511000000
FR          França     Europa       644         0    644000000
IT          Itália     Europa       301         1    301000000
UK     Reino Unido     Europa       244         0    244000000

In [35]:
# criar funções

def tem_verde(valor):
    if valor == 1:
        return "tem verde"
    else:
        return "Não tem verde"
    
paises['tem_verde'] = paises['corVerde'].apply(tem_verde)
paises

              nome continente  extensao  corVerde  area_em_km2      tem_verde
sigla
AR       Argentina    América      2780         0   2780000000  Não tem verde
BR          Brasil    América      8511         1   8511000000      tem verde
FR          França     Europa       644         0    644000000  Não tem verde
IT          Itália     Europa       301         1    301000000      tem verde
UK     Reino Unido     Europa       244         0    244000000  Não tem verde

In [39]:
# limpeza de dados
# exclusão

df = pd.DataFrame(dict(age=[5,6,np.NaN],
                      born = [pd.NaT, pd.Timestamp('1939-05-27'),
                             pd.Timestamp('1940-04-25')],
                      name = ['Alfred', 'Batman', ''],
                      toy = [None, 'Batmobile', 'Joker']))

df

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [40]:
print(df.notna()) # procura por campos válidos

     age   born  name    toy
0   True  False  True  False
1   True   True  True   True
2  False   True  True   True

In [41]:
df.dropna() # apago as linhas que tem elementos em branco ou não válidos

   age       born    name        toy
1  6.0 1939-05-27  Batman  Batmobile

In [42]:
# substituição de valores

df = pd.DataFrame({'A': [0,1,2,3,4],
                  'B': [5,6,7,8,9],
                  'C': ['a', 'b', 'c', 'd', 'e']})

df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [43]:
df.replace(0, 5)

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e